Repository: slow-spec85/SimpleGit11
Catalog: SimpleGit11.Plugin.Ssh/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# SshConnectionDialogTitle
source: Connect to a machine over SSH
ru_ru: Подключение к машине по SSH

# SshHostHeader
source: Host
ru_ru: Узел

# SshPortHeader
source: Port
ru_ru: Порт

# SshUsernameHeader
source: User name
ru_ru: Имя пользователя

# SshPasswordHeader
source: Password
ru_ru: Пароль

# SshPrivateKeyModeHeader
source: Connect using a private key
ru_ru: Подключение по приватному ключу

# SshPrivateKeyPathHeader
source: Private key path
ru_ru: Путь к закрытому ключу

# SshGeneratePrivateKeyButton
source: Generate a new private key
ru_ru: Сгенерировать новый ключ

# SshBrowsePrivateKeyButton
source: Browse for a private key
ru_ru: Выбрать файл приватного ключа

# SshGeneratedKeyPassphrasePromptTitle
source: Protect the new private key
ru_ru: Защита нового приватного ключа

# SshGeneratedKeyPassphrasePromptMessage
source: Enter a passphrase to encrypt the key, or leave both fields empty.
ru_ru: Задайте пароль для шифрования ключа или оставьте оба поля пустыми.

# SshGeneratedKeyPassphraseHeader
source: Passphrase
ru_ru: Пароль

# SshGeneratedKeyPassphraseConfirmationHeader
source: Confirm passphrase
ru_ru: Подтверждение пароля

# SshGeneratedKeyPassphraseMismatchMessage
source: The passphrases do not match.
ru_ru: Пароли не совпадают.

# SshGeneratedKeyPassphraseContinueButton
source: Continue
ru_ru: Продолжить

# SshPrivateKeyGenerationFailedMessage
source: The private key could not be generated: {0}
ru_ru: Не удалось сгенерировать приватный ключ: {0}

# SshPrivateKeyPassphrasePromptTitle
source: Private key passphrase
ru_ru: Пароль приватного ключа

# SshPrivateKeyPassphrasePromptMessage
source: The selected key is encrypted. Enter its passphrase to connect.
ru_ru: Выбранный ключ зашифрован. Введите пароль для подключения.

# SshPrivateKeyPassphraseInvalidMessage
source: The key could not be opened. Check the passphrase.
ru_ru: Не удалось открыть ключ. Проверьте пароль.

# SshPrivateKeyReadFailedMessage
source: The private key could not be read: {0}
ru_ru: Не удалось прочитать приватный ключ: {0}

# SshPrivateKeyPasswordNotice
source: On first setup, the app connects with the password, adds the public key to ~/.ssh/authorized_keys, and reconnects with the key. Passwords are not saved.
ru_ru: При первой настройке программа подключится по паролю, добавит публичный ключ в ~/.ssh/authorized_keys и повторно подключится по ключу. Пароли не сохраняются.

# SshConnectionFieldsRequiredMessage
source: Enter a host, a user name, and a valid port.
ru_ru: Укажите узел, имя пользователя и допустимый порт.

# SshPasswordRequiredMessage
source: Enter the server password.
ru_ru: Введите пароль пользователя на сервере.

# SshPrivateKeyRequiredMessage
source: Select a private key file.
ru_ru: Выберите файл приватного ключа.

# SshInitialPasswordRequiredMessage
source: Enter the server password for the initial public-key installation.
ru_ru: Для первоначальной установки публичного ключа введите пароль пользователя на сервере.

# SshConnectButton
source: Connect
ru_ru: Подключиться

# SshHostKeyDialogTitle
source: Verify SSH host
ru_ru: Проверка SSH-узла

# SshHostKeyDialogMessage
source: The identity of {0} is not trusted yet. Verify this SHA-256 fingerprint before connecting:\n\n{1}
ru_ru: Подлинность узла {0} ещё не подтверждена. Перед подключением проверьте отпечаток SHA-256:\n\n{1}

# SshTrustHostKeyButton
source: Trust and connect
ru_ru: Доверять и подключиться

# SshHostKeyChangedDialogTitle
source: SSH server key changed
ru_ru: Ключ SSH-сервера изменился

# SshHostKeyChangedDialogMessage
source: The SSH key presented by {0} differs from the key saved in this connection profile. This may indicate a server reconfiguration or an attempted interception. Verify both SHA-256 fingerprints before continuing:\n\nSaved: {1}\nReceived: {2}
ru_ru: Ключ, представленный SSH-сервером {0}, отличается от ключа, сохранённого в профиле подключения. Это может быть следствием перенастройки сервера или попытки перехвата соединения. Перед продолжением сверьте оба отпечатка SHA-256:\n\nСохранённый: {1}\nПолученный: {2}

# SshReplaceHostKeyButton
source: Replace key and connect
ru_ru: Заменить ключ и подключиться

# SshRememberProfileToggleSwitch
source: Remember settings (passwords are not saved)
ru_ru: Запомнить параметры (пароли не сохраняются)

# SshConnectionNavigationItem
source: SSH connection
ru_ru: Подключение по SSH

# SshConnectionBusyStatus
source: Connection settings are being processed
ru_ru: Выполняется настройка подключения

# SshConnectingStatus
source: Connecting to the SSH host…
ru_ru: Подключение к серверу SSH…

# SshConnectionFailedMessage
source: SSH connection failed.
ru_ru: Не удалось подключиться по SSH.

# SshConnectionActiveStatusFormat
source: Connected to {0}. Select to disconnect.
ru_ru: Подключено к {0}. Нажмите для отключения.

# SshConnectionInactiveStatus
source: Not connected. Select to configure a connection.
ru_ru: Нет подключения. Нажмите для настройки подключения.

# SshDisconnectDialogTitle
source: Disconnect SSH?
ru_ru: Отключиться от SSH?

# SshDisconnectDialogMessage
source: Disconnect from {0} and return to working on the local machine?
ru_ru: Отключиться от {0} и вернуться к работе на локальной машине?

# SshDisconnectConfirmButton
source: Disconnect
ru_ru: Отключиться

# SshSavedProfileHeader
source: Saved connection
ru_ru: Сохранённое подключение

# SshNewConnectionOption
source: New connection
ru_ru: Новое подключение

# SshDeleteProfileButton
source: Delete profile
ru_ru: Удалить профиль

# SshDeleteProfileDialogTitle
source: Delete SSH profile?
ru_ru: Удалить профиль SSH?

# SshDeleteProfileDialogMessage
source: The saved profile {0}@{1}:{2} will be deleted. Passwords and passphrases were not stored.
ru_ru: Сохранённый профиль {0}@{1}:{2} будет удалён. Пароли и парольные фразы не сохранялись.

# SshDeleteProfileConfirmButton
source: Delete
ru_ru: Удалить

# SshCancelButton
source: Cancel
ru_ru: Отмена
